{
  "title": "SAUVIK SAHA",
  "bio": "Full Stack Developer ▲",
  "socials": [
    {
      "name": "LinkedIn",
      "iconUrl": "https://raw.githubusercontent.com/sauviksaha/sauviksaha/main/assets/svgs/linkedin.svg",
      "link": "https://www.linkedin.com/in/sauviksaha"
    },
    {
      "name": "GitHub",
      "iconUrl": "https://raw.githubusercontent.com/sauviksaha/sauviksaha/main/assets/svgs/github.svg",
      "link": "https://github.com/sauviksaha"
    }
  ],
  "projects": [
    {
      "title": "Motor Training School",
      "description": "Developed a management system for a motor training school with multiple branches, user roles (Admin, Staff), courses, students, attendance, fees, expenses, categories, and cash journal reports. Integrated WhatsApp Business Cloud API and SMTP server for automatic messaging and email sending. Implemented session-based authentication with role-based access control, Server Actions, and React Query for the client side.",
      "url": ""
    },
    {
      "title": "Cab Booking Application",
      "description": "Developed a cab booking app allowing users to book rides in real-time, with features such as ride tracking, payment gateway integration, and user authentication. Integrated Google Maps for navigation and location tracking, and Firebase for notifications and crash reporting.",
      "url": ""
    },
    {
      "title": "E-commerce Application",
      "description": "Built an e-commerce platform for tractor spare parts, featuring over 31K products. Migrated data from a Microsoft SQL Server (BUSY Accounting) to MySQL. Implemented image compression to optimize the website’s performance and improve the user experience.",
      "url": ""
    },
    {
      "title": "Medical Clinic App",
      "description": "Created an app to manage medical staff attendance, real-time tracking, leaves, notices, push notifications, and reports, ensuring efficient staff management for the clinic.",
      "url": ""
    },
    {
      "title": "Employee Management App",
      "description": "Developed an app to manage over 300 employees’ attendance, notifications, notices, push notifications, and reports for efficient employee management.",
      "url": ""
    },
    {
      "title": "Tattoo Shop Website",
      "description": "Designed a functional frontend for a tattoo shop website, emphasizing simplicity and ease of use for a clean and accessible online presence.",
      "url": ""
    },
    {
      "title": "Portfolio",
      "description": "A portfolio web app where creativity converges with innovation, showcasing my diverse skills and passion for crafting memorable digital experiences.",
      "url": ""
    }
  ]
}
